* Extract TODOs with Elisp

#+BEGIN_SRC emacs-lisp :results output 
(dolist (file (directory-files-recursively default-directory "\\.py\\|\\.sh$"))
  (with-temp-buffer
    (insert-file-contents file)
    (goto-char (point-min))
    (while (re-search-forward "# TODO:.*" nil t)
      (let ((line (line-number-at-pos))
            (text (string-trim (match-string 0))))
        (princ (format "** TODO %s\n   [[file:%s::%d][%s:%d]]\n"
                       text file line (file-name-nondirectory file) line))))))
(prin1 default-directory)
#+END_SRC

#+RESULTS:
: "/ssh:nt:/fred/oz141/ldezoete/MS-G3D/"

